# Boolean2. Дано целое число А. Проверить истинность высказывания: «Число А является нечетным».
a = int(input())
print(a % 2 != 0)

# Boolean3. Дано целое число А. Проверить истинность высказывания: «Число А является четным».
a = int(input())
print(a % 2 == 0)

# Boolean4. Даны два целых числа: А, В. Проверить истинность высказывания: «Справедливы неравенства A > 2 и B <= 3».
a = int(input())
b = int(input())
print(a > 2 and b <= 3)

# Boolean5. Даны два целых числа: А, В. Проверить истинность высказывания: «Справедливы неравенства A >= 0 или B < -2».
a = int(input())
b = int(input())
print(a >= 0 or b < -2)

# Boolean7. Даны три целых числа: А, В, С. Проверить истинность высказывания: «Число В находится между числами А и С».
a = int(input())
b = int(input())
c = int(input())
print((a < b < c) or (c < b < a))

# Boolean8. Даны два целых числа: А, В. Проверить истинность высказывания: «Каждое из чисел А и В нечетное».
a = int(input())
b = int(input())
print(a % 2 != 0 and b % 2 != 0)

# Boolean9. Даны два целых числа: А, В. Проверить истинность высказывания: «Хотя бы одно из чисел А и В нечетное».
a = int(input())
b = int(input())
print(a % 2 != 0 or b % 2 != 0)

# Boolean10. Даны два целых числа: А, В. Проверить истинность высказывания: «Ровно одно из чисел А и В нечетное».
a = int(input())
b = int(input())
print((a % 2 != 0) + (b % 2 != 0) == 1)

# Boolean11. Даны два целых числа: А, В. Проверить истинность высказывания: «Числа А и В имеют одинаковую четность».
a = int(input())
b = int(input())
print(a % 2 == b % 2)

# Boolean13. Даны три целых числа: А, В, С. Проверить истинность высказывания: «Хотя бы одно из чисел А, В, С положительное».
a = int(input())
b = int(input())
c = int(input())
print(a > 0 or b > 0 or c > 0)

# Boolean15. Даны три целых числа: А, В, С. Проверить истинность высказывания: «Ровно два из чисел А, В, С являются положительными».
a = int(input())
b = int(input())
c = int(input())
count = (a > 0) + (b > 0) + (c > 0)
print(count == 2)

# If1. Дано целое число. Если оно является положительным, то прибавить к нему 1; в противном случае не изменять его.
number = int(input())
if number > 0:
    number += 1
print(number)

# If2. Дано целое число. Если оно является положительным, то прибавить к нему 1; в противном случае вычесть из него 2.
number = int(input())
if number > 0:
    number += 1
else:
    number -= 2
print(number)

# If4. Даны три целых числа. Найти количество положительных чисел в исходном наборе.
a = int(input())
b = int(input())
c = int(input())
count_positive = (a > 0) + (b > 0) + (c > 0)
print(count_positive)

# If5. Даны три целых числа. Найти количество положительных и количество отрицательных чисел в исходном наборе.
a = int(input())
b = int(input())
c = int(input())
count_positive = (a > 0) + (b > 0) + (c > 0)
count_negative = (a < 0) + (b < 0) + (c < 0)
print(count_positive)
print(count_negative)